DataProcessors/ЗаблокироватьТТПоСКладамКРаспределению.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<DataProcessor>
		<Properties>
			<Name>ЗаблокироватьТТПоСКладамКРаспределению</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КомпоновщикНастроек_Склады</Name>
					<Type>
						<v8:Type>dcsset:SettingsComposer</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КомпоновщикНастроек_ТТ</Name>
					<Type>
						<v8:Type>dcsset:SettingsComposer</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыполняемоеДействие</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТорговыеТочки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТТ</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Блокировка</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СкладыХранения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СкладХранения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Склады</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

DataProcessors/ЗаблокироватьТТПоСКладамКРаспределению/Ext/ObjectModule.bsl
//+++АК LATV 2018.10.24 ИП-00020239
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)

	Если ВыполняемоеДействие = "ЗаполнениеСкладов" Тогда
		
	ИначеЕсли ВыполняемоеДействие = "ЗаполнениеТТ" Тогда
		ПроверяемыеРеквизиты.Добавить("СкладыХранения");
		ПроверяемыеРеквизиты.Добавить("СкладыХранения.СкладХранения");
		
	ИначеЕсли ВыполняемоеДействие = "ИзменениеБлокировки" Тогда
		ПроверяемыеРеквизиты.Добавить("СкладыХранения");
		ПроверяемыеРеквизиты.Добавить("СкладыХранения.СкладХранения");
		ПроверяемыеРеквизиты.Добавить("ТорговыеТочки");
		
	КонецЕсли;

КонецПроцедуры
